/*8.编写程序，将一个二维数组中行和列元素互换，存到另一个二维数组中。
设数组如下：
    1    5    9           1    2
a=                     b= 5    6
    2    6    8           9    8
    要求：输出显示原二维数组和置换后的二维数组，并有提示。
*/
#include <stdio.h>
void main()
{
    int a[2][3]={{1,5,9},{2,6,8}},b[3][2],i,j;
    //打印原二维数组a[2][3]
    printf("a:\n");
    for(i=0;i<=1;i++)
    {
        for(j=0;j<=2;j++)
        {
            printf("%d\t",a[i][j]);
        }
        printf("\n");
    }
    //进行值交换并赋给新二维数组b[3][2]
    for(i=0;i<=2;i++)
    {
        for(j=0;j<=1;j++)
        {
            b[i][j]=a[j][i];
        }
    }
    //打印新二维数组b[3][2]
    printf("b:\n");
    for(i=0;i<=2;i++)
    {
        for(j=0;j<=1;j++)
        {
            printf("%d\t",b[i][j]);
        }
        printf("\n");
    }
}